# Функции:
# Встроенные:
# input()
# print()
# len()
# min() and max() and further


# Пользовательская :


# def artem():          
#     print("hi world") - Функция которая хранит и выводит определенные данные когда приходит запрос на ее действие или на взаимодейcтвие с ней(function) 
# artem()
# ---------------------------------------------------------------------------------------------------------------------------------------------------------
# def result(name, age):
#     print(f"привет, {name} , Вам {age} лет") - () - этот знак как крышка для функции 

# result("Geeks" , 18) при помощи этого кода мы как б заносим значения в нашу функцию

# def result(name, age):
#     print(f"привет, {name}  Тебе {age} лет")

# result("Марк" , 18)

# Анонимные: (lambda)
# нету названия
# Однастрочная функция - пишется в одну строку без отступов


# result = lambda num1 , num2 : num1 + num2
# print(result(12, 24))
# --------------------------------------------------------------------------------------------------------------------------------------------------------
# name = lambda name_: f"привет , {name_}"
# print(name("Aliars"))


# numbers = [2,3,4,5,6,7,8,9]
# for num in numbers:
    # print(num * 2)
# map - альтернатива функии цикла for (производит итерацию) используется в лямбде 
# result = list(map(lambda num: num*3, numbers))
# print(result)

# numbers = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15]
# for num in numbers:
#     if num % 2 ==0:
#         print(num)
# filter альтернатива операторам условия используемое в лямбде -выводит результаты согласно условиям остальное отсееивает и также выполняет работу цикла(итерацию(повторение)) 
# result = list(filter(lambda num: num % 2 == 0 , numbers))
# print(result)

